//
//  TableViewController.swift
//  newsTable
//
//  Created by РАХАТ  on 04.12.2023.
//

import UIKit

var text1 = "Высокогорный спортивный комплекс «Медео» («Медеу») расположен на высоте 1691 метр над уровнем моря в 15 километрах к западу от Алматы. Он был представлен общественности в 1951 году, когда здесь были проведены первые официальные соревнования. «Медеу» - самый большой в мире комплекс для занятий зимними видами спорта, здесь находится крупнейшее ледовое поле площадью 10,5 тыс. кв. м, где занимаются хоккеем, фигурным катанием, конькобежным спортом. Каток «Медео» - лидер по количеству мировых рекордов в конькобежном спорте, всего их здесь было установлено более 200, как среди мужчин, так и среди женщин; в советские времена его так и называли «фабрикой рекордов». «Медео» также признан государственным памятником градостроительства и архитектуры Республиканского значения. В 2011 году была построена канатная дорога, которая соединила «Медео» с горнолыжной базой «Чимбулак». \n\nСпорткомлпекс «Медео» и его замечательный каток, несомненно, занимают одно из важнейших мест в списке ТОП-10 лучших достопримечательностей Алматы. Если вы фанат зимних видов спорта, обязательно посетите его, здесь есть прокат снаряжения, а на катке регулярно проводятся флешмобы и мероприятия для посетителей."
var text2 = "Список ТОП-10 лучших достопримечательностей Алматы будет неполным без упоминания Свято-Вознесенского Кафедрального собора – интереснейшей, необычной архитектурной достопримечательности города. Это самый высокий православный деревянный храм, а также одно из самых высоких деревянных зданий в мире. Вместительность собора – 1800 человек. Проект 56-метрового деревянного здания, построенного в начале XX века, как поговаривают, без использования гвоздей, осуществлял инженер Андрей Зенков, поэтому храм иногда называют Кафедральным собором Зенкова. Построили собор из сруба голубой тянь-шаньской ели. Строить такое высокое здание в сейсмоопасном регионе, а Алматы – самый настоящий горный город, раскинувшийся в предгорьях Заилийского Алатау, было довольно рискованной затеей. Но Зенков справился с поставленной задачей. Да так хорошо, что здание выстояло и смогло пережить разрушительное землетрясение 1911 года, после которого практически весь Алматы лежал в руинах. \n\nВознесенский Кафедральный собор – это пятиглавый храм, который находится в Парке 28 гвардейцев-панфиловцев. Обязательно уделите внимание этому уникальному памятнику деревянного зодчества в стиле украинского барокко, рассмотрите внутреннее убранство храма и его стены, украшенные красивыми фресками и расписным иконостасом."
var text3 = "Каньон Чарын – главная достопримечательность Чарынского национального парка, а также один из главных пунктов, входящих в список ТОП-10 лучших достопримечательностей Алматы. Неземные ландшафты Чарынского каньона в 200 км от Алматы - это то, что вы непременно должны увидеть, если заглянули в «Южную столицу». \n\nЧарынский каньон тянется на 154 км вдоль реки Нарын, а возраст осадочных пород, из которых сложено это чудо природы, составляет около 12 миллионов лет. Часто Чарынский каньон называют «братом» знаменитого и колоссального Гранд-Каньона в США. Это великолепной красоты захватывающее дух зрелище, кроме того, на территории Чарынского каньона расположено множество природных достопримечательностей: уникальная Ясеневая роща площадью в 5000 га из согдийских ясеней, достигающих до 10 метров в высоту (одна из двух подобных рощ во всем мире, вторая находится в Северной Америке), «Долина замков», Туранговая роща. Кроме того, здесь есть туристический комплекс, оснащенный летними кафе, беседками и бунгало, что очень кстати, ведь экскурсии по каньону обычно довольно долгие, могут занимать целый день, так что туристам обязательно захочется отдохнуть и перекусить."
var text4 = "Поющий бархан – уникальное явление природы, которое можно увидеть в государственном национальном природном парке Алтын-Эмель, расположенном в 182 км от Алматы. Длина Поющего бархана составляет 1.5 км, а высота – до 120 метров; из всех известных барханов он считается самым большим. По описаниям можно подумать, что Поющий бархан находится где-то в золотой пустыне, но это не так. Удивительно, но бархан образовался среди каменных гор, а если точнее – между двух каменистых сопок Малого и Большого Калкана.\n\nКак же поёт бархан? Научно это объясняется так: в достаточно сухую погоду песчинки сбегают вниз, трутся друг об друга, засчет чего электризуются, и возникает вибрация, дающая гудящий звук. И этот звук очень напоминает торжественную органную музыку. Однако нужно помнить, что бархан не «поёт» постоянно: необходимо оказаться рядом с ним в подходящее время, чтобы совпало несколько факторов. Поэтому, если бархан будет молчать, не расстраивайтесь, в национальном природном парке Алтын-Эмель есть и другие очень интересные достопримечательности: комплекс сакских курганов Бес-Шатыр – наследие кочевников, инопланетные меловые горы Актау, рощи и ущелья, множество живописных маршрутов, которые позволят провести день, полный впечатлений. \n\nВ крайнем случае, есть способ «оживить» безмолвный бархан, если погода выдастся безветренной: нужно забраться по склону, а затем, разбежавшись, прыгнуть вниз туда, где слой сухого песка толще, и бархан загудит. Подъем вверх не очень прост: ноги увязают в песке, поэтому нужно быть в удобной обуви."
var text5 = "Большое Алматинское озеро или БАО расположено в 20 км от города и обязательно должно быть включено в список топ 10 лучших достопримечательностей Алматы. Это озеро возникло в результате землетрясения, его глубина 30-40 метров, а длина береговой линии составляет 3 километра. Большое Алматинское озеро, которое питают ледниковые воды, известно тем, что цвет его вод меняется от бирюзового до свинцового в зависимости от времени суток и погоды. К берегу озера спуститься не получится, потому что оно является запасным водным резервуаром для Алматы, но есть прекрасные смотровые площадки, с которых можно насладиться живописными видами на БАО. Также не воспрещается неторопливо прогуливаться по окрестностям озера, любуясь окружающей природой, вдыхать насыщенный ароматами благоухающих трав свежий воздух . Над гладью озера возвышаются четыре горных пика: Каныша Саптаева (бывш. Советский), Озерный, Большой Алматинский и Турист. Их высота разная и колеблется от 3600 до 4300 метров."

class TableViewController: UITableViewController {
    
    var arrayAttractions = [
        info(imageName: "1", textField: "Высокогорный спорткомплекс «Медео»", textInfo: "\(text1)", latForAtt: 43.2374454, longForAtt: 77.05861100),
        info(imageName: "2", textField: "Вознесенский Кафедральный собор", textInfo: "\(text2)", latForAtt: 43.258810, longForAtt: 76.953258),
        info(imageName: "3", textField: "Чарынский каньон", textInfo: "\(text3)", latForAtt: 43.351131, longForAtt: 79.078015),
        info(imageName: "4", textField: "Магический Поющий бархан", textInfo: "\(text4)", latForAtt: 43.870598, longForAtt: 78.563177),
        info(imageName: "5", textField: "Большое Алматинское озеро", textInfo: "\(text5)", latForAtt: 43.051844, longForAtt: 76.983967)
    ]
    
    override func viewDidLoad() {
        super.viewDidLoad()
    }
    
    override func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return arrayAttractions.count
    }
    
    // MARK: - Table view data source
    
    override func numberOfSections(in tableView: UITableView) -> Int {
        return 1
    }
    
    override func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView.dequeueReusableCell(withIdentifier: "Cell", for: indexPath)
        

        let imageView = cell.viewWithTag(1) as! UIImageView
            imageView.image = UIImage(named: arrayAttractions[indexPath.row].imageName)
                
        let labelNews = cell.viewWithTag(2) as! UILabel
            labelNews.text = arrayAttractions[indexPath.row].textField

        return cell
    }
    
    override func tableView(_ tableView: UITableView, heightForRowAt indexPath: IndexPath) -> CGFloat {
        return 400
    }
    
    override func tableView(_ tableView: UITableView, didSelectRowAt indexPath: IndexPath) {
        let detailVc = storyboard?.instantiateViewController(withIdentifier: "detailViewController") as! ViewController
        
        detailVc.fullInfo = arrayAttractions[indexPath.row]
        
        navigationController?.show(detailVc, sender: self)
    }
    

    /*
    // Override to support conditional editing of the table view.
    override func tableView(_ tableView: UITableView, canEditRowAt indexPath: IndexPath) -> Bool {
        // Return false if you do not want the specified item to be editable.
        return true
    }
    */

    /*
    // Override to support editing the table view.
    override func tableView(_ tableView: UITableView, commit editingStyle: UITableViewCell.EditingStyle, forRowAt indexPath: IndexPath) {
        if editingStyle == .delete {
            // Delete the row from the data source
            arrayNews.remove(at: indexPath.row)

            tableView.deleteRows(at: [indexPath], with: .fade)
        } else if editingStyle == .insert {
            // Create a new instance of the appropriate class, insert it into the array, and add a new row to the table view
        }
    }
    */

    /*
    // Override to support rearranging the table view.
    override func tableView(_ tableView: UITableView, moveRowAt fromIndexPath: IndexPath, to: IndexPath) {

    }
    */

    /*
    // Override to support conditional rearranging of the table view.
    override func tableView(_ tableView: UITableView, canMoveRowAt indexPath: IndexPath) -> Bool {
        // Return false if you do not want the item to be re-orderable.
        return true
    }
    */

    /*
    // MARK: - Navigation

    // In a storyboard-based application, you will often want to do a little preparation before navigation
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
        // Get the new view controller using segue.destination.
        // Pass the selected object to the new view controller.
    }
    */

}
